{

"modules":
[
    {
        "mod_id": "1",
        "mod_header": "The Beginner's Guide to Understanding Islam",
        "mod_img": "https://www.mymasjid.ca/wp-content/uploads/2017/12/What-is-Islam_.jpg",

        "lessons": [
        {
            "id": "L1",   
            "title": "Introduction to Islam",
            "header_1": "Arabic Terms",
            "header_2": "Introduction",
            "header_3": "The Importance of the Testimony of Faith",
            "header_4": "The Meaning of <i>La ilaha illa Allah</i>",
            "header_5": "The Meaning of <i>Muhammad rasoolu Allah</i>",
            "text_1": "<ul class='list'><li><i>Shahadah</i> - Testimony of Faith.</li> <li><i>Allah</i> - Allah, one of the names of God.</li> <li><i>Tawheed</i> - The Oneness and Uniqueness of Allah with respect to His Lordship, His Names and Attributes and in His right to be worshipped.</li></ul>",
            "text_2": "<p>The core of the religion of Islam is the attestation to two phrases:</p> <p style='text-indent: 0%; line-height: 2.3'>(i)  <i>La ilaha illa Allah</i> (meaning ‘There is no god rightfully worshipped except Allah’) <p style='text-indent: 0%; line-height: 2.3'>(ii)  <i>Muhammad rasoolu Allah</i> (meaning ‘Muhammad is the Messenger of Allah’)</p> <p>These two phrases are known as the Shahadah, or Testimony of Faith. Through the belief and attestation of these two phrases one enters the fold of Islam. It is the central belief that a believer maintains throughout his life, and is the basis for all his beliefs, worship and existence in this world.</p> <p>Every Muslim, including someone new to Islam, has to understand the meanings of these two phrases, and try to live his life accordingly.</p>", 
            "text_3": "<p>This Testimony is by far the most important aspect of the religion of Islam, upon which the whole religion is built. Islam is the only true monotheistic religion, stressing that no worship should be directed to any other except Allah. It is a way of life in which a person obeys and worships the orders of Allah and none else.</p> <p>This Testimony of Faith (Shahadah) reminds us of our purpose in life, which is the worship of Allah alone.  Allah says in the Quran:</p> <blockquote>“And I have not created neither jinn nor humans, except to worship Me Alone.” (Quran 51:56)</blockquote> <p>The message of the Oneness of God (Tawheed) found in the Testimony was not particular to the message of Prophet Muhammad, may the mercy and blessings of Allah be upon him. It was the universal message of all Prophets of Allah. Since the dawn of humanity, Allah sent Messengers to every people and nation, commanding them to worship Him Alone, and to reject all false deities. Allah says:</p> <blockquote>“And indeed We have raised amongst every nation a Messenger, [commanding them] 'Worship Allah, and reject all false deities'.” (Quran 16:36)</blockquote>",
            "text_4": "<p style='line-height: 2.3'>The meaning of each word in the phrase is:</p> <p style='line-height: 2.3';'><i>La</i>: There is no; &nbsp<i>ilaha</i>: god (deity); &nbsp;<i>illa</i>: except; &nbsp;<i>Allah</i>: Allah (God)</p> <p style='line-height: 2.3'>And therefore the literal meaning of this phrase is “There is no god (deity) except Allah”</p> <p style='font-size: 1.8em; margin: 10px 0 15px 0; text-indent: 0%;'>First Part of this phrase: Rejection</p> <p>‘There is no god (deity)’… Here, god with a small case ‘g’ is anything which is worshipped. Many people have taken things in creation as their gods and deities, but they are all false and are wrongfully worshipped, meaning that they have no right to that worship, nor do they deserve it. This rejection extends to all superstitions, ideologies, ways of life, or any authority figures who claim divine devotion.</p> <p>Some people imagine the Divine Kingdom of God to be like earthly kingdoms. Just as a king has many ministers and trusted associates, they imagine ‘saints’ and minor deities to be our intercessors to God.  They take them as agents through whom God is approached. In truth, there are no intercessors in Islam, nor any class of clergy to whom one must ‘confess’ their sins to be forgiven. A Muslim prays directly and exclusively to God. We also reject superstitious practices such as astrology, palm reading, good luck charms, and fortune-telling.</p> <p style='font-size: 1.8em; margin: 15px 0 15px 0; text-indent: 0%;'>Second Part of this phrase: Affirmation</p> <p>‘Except Allah’… After denying the right of any created being to be worshipped, the Testimony affirms divinity for Allah alone, with ‘…except Allah.’</p> <p>Allah, in the Quran, mentions in many places that all things which people take as objects of worship besides Allah do not deserve any worship, nor do they have any right over it, as they themselves are creations and have no power to bring any benefit.</p> <blockquote>Yet they have taken besides Him other gods that created nothing but are themselves created, and possess neither hurt nor benefit for themselves, and possess no power (of causing) death, nor (of giving) life, nor of raising the dead” (Quran 25:3)</blockquote> <p>Thus, <i>la ilaha illa Allah</i> means, “There is no true god except Allah” or “There is no god rightfully worshipped except Allah.”",    
            "text_5": "<p style='line-height: 2.3'>The meaning of each word in the phrase is:</p><p style='line-height: 2.3'><i>Muhammad</i>: Prophet Muhammad; &nbsp;<i>rasoolu</i>: Messenger; &nbsp;<i>Allah</i>: Allah (God)</p> <p style='line-height: 2.3'>And therefore this phrase means, “Muhammad is the Messenger of Allah”.</p> <p>By testifying to this fact, one affirms that Prophet Muhammad is in fact a Prophet and Messenger raised by God, amongst mankind to deliver the message of God, as were other Prophets and Messengers. Attesting to this fact implies a multitude of meanings. These include:</p><p>1.  To believe that he was the last Prophet and Messenger.</p> <blockquote>“Muhammad is not the father of any man among you but he is the Messenger of Allah and the last of the Prophets and Allah is Ever All-Aware of everything” (Quran 33:40)</blockquote> <p>2.  To believe that he delivered the message of Allah faithfully just as he received it without any deficiency. Allah says:</p> <blockquote>“…This day, I have perfected your religion for you, and completed My Favor upon you, and have chosen for you Islam as your religion…” (Quran 5:3)</blockquote> <p>3.  To believe that he was a Prophet to all mankind. Allah says:</p> <blockquote>“Say: O humanity!  I am Allah’s Messenger to you all…” (Quran 7:158)</blockquote> <p>4.  To believe that everything he said about the religion was revealed from Allah. He is to be taken as an example and obeyed without reservation as he speaks in the Name of Allah and obeying him is obeying Allah.</p> <blockquote>“He does not speak from his own desire, it (his speech) is only a revelation inspired [to him]” (Quran 53:3-4)</blockquote> <blockquote>“He who obeys the Messenger, obeys Allah...” (Quran 4:80)</blockquote> <p>5.  We must worship Allah according to the law brought by him. He abolished all previous laws including the Mosaic Law.</p> <blockquote>“And whoever desires a religion other than Islam, it shall not be accepted from him, and in the Hereafter he shall be one of the losers.” (Quran 3:85)</blockquote> <p>6.  Prophet Muhammad is to be loved and honoured.  Knowing about his morals, his sacrifices for spreading monotheism, and patience with his opponents all increase one’s appreciation of him.  The more we learn about his life and characteristics, the more we will increase in our love for him.<p> <p>In summary, the testimony <i>Muhammad rasoolu Allah</i> means obeying Prophet Muhmmad in what he commands, believing him in what he informs, shunning what he has prohibited, and worshipping Allah alone the way he instructed us.  These matters are not restricted to a certain people or to a specific time.</p>"

        },
    
        {
            "id": "L2",
            "title": "The Five Pillars of Islam",
            "header_1": "Arabic Terms",
            "header_2": "The Meaning of ‘Islam’",
            "header_3": "The Five Pillars of Islam",
            "header_4": "",
            "text_1": "<ul class='list'><li><i>Hadith</i> - (plural - ahadith) is a piece of information or a story. In Islam it is a narrative record of the sayings and actions of Prophet Muhammad and his companions.</li> <li><i>Kabah</i> - The cube-shaped structure located in the city of Mecca.  It serves as a focal point towards which all Muslims face when praying.</li> <li><i>Salah</i> - the Arabic word to denote a direct connection between the believer and Allah.  More specifically, in Islam it refers to the formal five daily prayers and is the most important form of worship.</li> <li><i>Ramadan</i> - The ninth month of the Islamic lunar calendar.  It is the month in which the obligatory fasting has been prescribed.</li> <li><i>Sawm</i> - Fasting.</li> <li><i>Hajj</i> - A pilgrimage to Mecca where the pilgrim performs a set of rituals.  The Hajj is one of the five pillars of Islam, which every adult Muslim must undertake at least once in their life if they can afford it and are physically able.</li> <li><i>Zakah</i> - obligatory charity.</li> <li><i>Imaan</i> - faith, belief or conviction.</li><p style='margin: 30px 0 30px 0;'>The essential teachings of Islam are based on five principles, referred to as the ‘Five Pillars of Islam’, and six fundamental beliefs, known as the ‘Six Articles of Faith.’ This division is based on the following well known hadith of Prophet Muhammad, may the mercy and blessings of Allah be upon him. Umar, one of the closest of companions to the Prophet, related the following occurrence:</p><p style='text-indent: 0%; font-weight: bold;'>“Once, while we were sitting with the Prophet, a man appeared before us whose clothes were exceedingly white and hair exceedingly black.  No signs of traveling were seen on him and no one among us knew him.  He sat towards the Prophet, resting his knees against his knees and placing the palms of his hands on his thighs. He then said: ‘O Muhammad, tell me about Islam.’</p> <p style='text-indent: 0%; font-weight: bold;'>The Messenger replied: ‘Islam is to testify that there is no god worthy of worship except Allah and Muhammad is the Messenger of Allah, to perform the prayers, to pay the compulsory charity (<i>zakah</i>), to fast in <i>Ramadan</i>, and to make the pilgrimage to the House if you are able to do so.’<p> <p style='text-indent: 0%; font-weight: bold;'>He said: ‘You have spoken the truth.’</p> <p style='text-indent: 0%; font-weight: bold;'>We were amazed at him asking questions and then saying he had spoken the truth!</p> <p style='text-indent: 0%; font-weight: bold;'>He then inquired: ‘Tell me about faith (<i>Imaan</i>)?’</p> <p style='text-indent: 0%; font-weight: bold;'>The Prophet replied: ‘It is to believe in Allah, His angels, His scriptures, His messengers, and the Last Day, and to believe in divine decree, both its sweetness and its bitterness.’</p> <p style='text-indent: 0%; font-weight: bold;'>He said: ‘You have spoken the truth.’</p> <p>Umar then related some more questions he asked and the answers given by the Prophet.  Finally, when the man left, the Prophet asked:</p> <p style='text-indent: 0%; font-weight: bold;'>‘O ‘Umar, do you know who was the questioner?’</p> <p style='text-indent: 0%; font-weight: bold;'>I said: ‘Allah and His Messenger know best.’</p> <p style='text-indent: 0%; font-weight: bold;'>The Prophet said: ‘It was Gabriel who came to you to teach you your religion.’”</p>",
            "text_2": "<p>The Arabic word <i style='font-weight: bold'>‘Islam’</i> means to submit, a total surrender, a total resignation to God.  Therefore, a ‘Muslim’ is ‘one who submits to God.’ Islam means to submit to Allah alone, to worship and serve Allah alone, and to believe and follow the prophet sent to them.  To many non-Muslims, ‘Islam’ is a religion that began in the seventh century in the Middle East, but to Muslims, Islam has always been the only religion of Allah since the time of Adam, the first man.  Thus, Islam was the religion of all prophets who came after him.  In the time of Moses, Islam was to worship Allah alone and believe and follow the teachings Moses had brought, and Islam in the time of Jesus was to worship Allah alone and believe and follow the teachings Jesus had brought, as they were both prophets sent by God to teach his religion.  After the coming of Prophet Muhammad, Islam is to worship Allah alone and believe and follow the teachings of Prophet Muhammad. Although the teachings of all the prophets about God, the Afterlife, and all other realities of belief were the same, there were slight differences in the methods of practice, worship and service, for each prophet was sent to a specific nation and specific period of time. Even though previous religions come under the general heading of Islam, the religion of Muhammad has specifically been given the name ‘Islam’ by God, as it is the final religion prescribed for humanity until the Day of Judgment.</p>",
            "text_3": "<p>Allah has mandated five acts upon which the whole religion of Islam is built. Due to their importance, the Prophet stated in another <i>hadith</i>:</p> <p style='font-weight: bold; text-indent: 0%; line-height: 2.3'>“Islam has been built upon five…”</p> <p style='text-indent: 0%;'>…and then proceeded to mention the same acts of worship described in the <i>hadith</i> of Gabriel above.<p> <p>These acts of worship are called the Pillars of Islam, and they are as follows:<p> <p style='line-height: 2.3; text-indent: 0%; font-size: 1.8em'>1. Testimony of faith (<i>Shahadah</i>)</p> <p>One must profess this testimony of faith, summarized in the two testimonies:</p> <p style='line-height: 2.3; text-indent: 0%'>(a) There is no deity rightfully worshipped but Allah</p> <p style='line-height: 2.3; text-indent: 0%'>(b) Muhammad is His Messenger.</p> <p>Through the belief and attestation of the Testimony of Faith (Shahadah) one enters the fold of Islam. It is the central belief that a believer maintains throughout his life, and is the basis for all his beliefs and worship.</p> <p style='line-height: 2.3; text-indent: 0%; font-size: 1.8em'>2. Formal Prayers (<i>Salah</i>)</p> <p>One must offer the five daily prayers at their specific times. Through the prayer, a Muslim maintains his relationship with Allah, comes to remember Him often, and avoids falling into sin.</p> <p style='line-height: 2.3; text-indent: 0%; font-size: 1.8em'>3. Compulsory Charity (<i>Zakah</i>)</p> <p>Those who have stored a certain amount of wealth must allot a specific portion of it annually to designated deserving recipients.</p> <p style='line-height: 2.3; text-indent: 0%; font-size: 1.8em'>4. Fasting (<i>Sawm</i>)</p> <p>Muslims must fast for a period of one lunar month, which is the month of Ramadan, by refraining from food, drink and sexual intercourse from dawn to dusk. The goal of fasting, as mentioned in the Quran, is to increase one’s piety and God-consciousness.</p> <p style='line-height: 2.3; text-indent: 0%; font-size: 1.8em'>5. Pilgrimage (<i>Hajj</i>)</p> <p>Pilgrimage to the House of God, the Kabah, in Mecca is obligatory for every able Muslim once in a lifetime. The Hajj is a physical and visual proof of the brotherhood of humanity, and their equality in servitude in front of Allah.</p>",
            "text_4": ""
        },
        
        {
            "id": "L3",
            "title": "Articles of Faith",
            "header_1": "Arabic Terms",
            "header_2": "The Six Articles of Faith",
            "header_3": "",
            "text_1": "<ul class='list'><li><i>Sunnah</i> - The word Sunnah has several meanings depending on the area of study however the meaning is generally accepted to be, whatever was reported that the Prophet said, did, or approved.</li> <li><i>Imaan</i> - faith, belief or conviction.</li></ul>",
            "text_2": "<p>Faith is referred to in Arabic as Imaan.  It represents firm belief in the heart, and not simply blind faith. Islamic doctrine revolves around six aspects described by the Prophet.</p> <p style='line-height: 2.7; text-indent: 0%;'> <b>1. Belief in Allah</b>, which entails the following:</p> <ol class='custom-marker parens-around lower-roman'><li>Belief in Allah’s existence.</li> <li>Allah is the Lord. He is the Creator, the Provider, the Sustainer, and the Owner of the entire universe. None has any share in these roles.</li> <li>Allah is the only being entitled to worship. No worship, service or veneration is to be offered to others besides Allah or along with Him, whether they be prophets, priests, saints, angels, idols, or stones.</li> <li>Allah has the most beautiful and perfect of names and attributes, which none can be compared to. He is Unique, separate and unlike His creation. No evil or deficiency can be attributed to Him.</li></ol> <p style='line-height: 2.7; text-indent: 0%;'> <b>2. Belief in the Angels</b>, which entails the following:</p> <ol class='custom-marker parens-around lower-roman'><li>Belief in the existence of angels, a creation of Allah.</li> <li>Belief that they have no right to receive any form of worship.</li> <li>Belief in the names by which the angels are identified in the Quran and <i>Sunnah</i> (teachings of Prophet Muhammad).</li> <li>Belief in the special tasks assigned to each of them by Allah in the Quran and <i>Sunnah</i> (teachings of Prophet Muhammad).</li></ol> <p style='line-height: 2.7; text-indent: 0%;'> <b>3. Belief in the Revealed Scriptures</b>, which entails the following:</p> <ol class='custom-marker parens-around lower-roman'><li>Belief that Allah revealed scriptures to various prophets.</li> <li>Belief that they contained the truth from Allah.</li> <li>Belief that all previous scriptures other than the Quran have been altered.</li> <li>Belief in the Quran has several aspects:</li> <ol style='text-indent: 30px;'><li>a) Belief that it is one of the scriptures of Allah.</li> <li>b) Belief that it is the Final Revelation to humanity, and that no other scripture will be revealed after it.</li> <li>c) Belief that everything in it is true, containing no falseness.</li> <li>d) Belief that it has remained unchanged, and will remain so for eternity.</li> <li>e) Belief that it has abrogated all previous scriptures before it.</li></ol></ol> <p style='line-height: 2.7; text-indent: 0%;'><b>4. Belief in the Messengers</b>, which entails the following:</p> <ol class='custom-marker parens-around lower-roman'><li>Belief that Allah sent prophets to every nation, calling them to worship and obey Allah Alone. One must believe in all of them, known or unknown, without rejecting any of them.</li> <li>Belief that they were the best of humanity, chosen due to their virtuousness.</li> <li>Belief that they were mere humans, not divine in any way, and that they do not have any right to receive worship, nor did they claim so.</li> <li>Belief that they merely conveyed the message from Allah and did not legislate from their own selves.</li> <li>Belief that they did not err in conveying the message.</li> <li>Belief that obedience to them is a must.</li> <li>Belief that Muhammad, may the mercy and blessings of Allah be upon him, was a prophet, which entails those issues discussed in the lesson entitled The Testimony of Faith.</li></ol> <p style='line-height: 2.7; text-indent: 0%;'><b>5. Belief in Life after Death and the Final Day of Judgment</b>, which entails the following:</p> <ol class='custom-marker parens-around lower-roman'><li>Belief that a day will come when everything will come to an end, and Allah will raise the creation and judge them according to their deeds.</li> <li>Belief that those who believed and practically followed the correct religion by following the prophets will enter Paradise for eternity, and that those who disbelieved will enter the Hellfire for eternity.</li></ol> <p style='line-height: 2.7; text-indent: 0%;'><b>6. Belief in Divine Decree</b>, which entails the following:</p> <ol class='custom-marker parens-around lower-roman'><li>Belief that Allah’s Foreknowledge is all inclusive and complete. He has always known everything that would or would not happen, even before the creation of mankind.</li> <li>Belief that Allah has recorded everything that was going to occur until the Day of Judgment in a book known as “The Mother of the Books” or “The Preserved Tablet”.</li> <li>Belief that whatever Allah willed has occurred, is occurring, and will occur. Nothing occurs against or without this Will.</li> <li>Allah created everything.</li></ol> <p style='margin: 30px 0 30px 0;'>We have mentioned here the minimal requirements of faith in each of these six categories that Muslims believe in, as the Prophet mentioned that these articles form the basis of Islamic belief and faith.</p> <p>In subsequent lessons, we will explore the essential teachings by studying each of the Five Pillars of Islam and the Six Articles of Faith in detail.</p>",
            "text_3": ""
        },

        {
            "id": "L4",
            "title": "Introduction to the Quran: What is Quran and its Organization",
            "header_1": "Arabic Terms",
            "header_2": "Exactly What is The Quran?",
            "header_3": "The Basics",
            "header_4": "How is The Quran Organized?",
            "header_5": "Style of the Quran",
            "text_1": "<ul class='list'><li><i>Surah</i> – chapter of the Quran.</li> <li><i>Ramadan</i> - The ninth month of the Islamic lunar calendar.  It is the month in which the obligatory fasting has been prescribed.</li> <li><i>Juz’</i> - one of thirty parts of the Quran.</li> <li><i>Aayaat</i> - (singular – <i>ayah</i>) the word aayaat can have many meanings. It is almost always used when talking about proofs from Allah. These include evidences, verses, lessons, signs, and revelations.</li></ul> <p style='margin: 30px 0 30px 0;'>In two lessons, we will focus on some basic issues a beginner will face when approaching the Quran.  What is the Quran and how is it organized?  What are its major themes and its style of presentation?  What are some good translations for a beginner, and what must we keep in mind when reading them?  Can the Quran be interpreted freely according to one’s heart?</p>",
            "text_2": "<p>The Quran is the literal, spoken Word of Allah revealed to the last Prophet Muhammad, may the mercy and blessings of Allah be upon him, through Gabriel, the Angel of Revelation, transmitted to us by numerous channels, both verbally and in written form.  Inimitable and unique, it is divinely protected from corruption. God says:</p> <blockquote>‘Indeed, it is We who sent down the message [i.e., the Qur'an] and indeed, We will be its guardian.’ (Quran 15:9)</blockquote>",
            "text_3": "<p>The first thing for a beginner to understand about the Quran is its form.  The Arabic word, ‘Quran,’ literally means both ‘recitation’ and ‘reading’. Similarly, the Quran was both recited orally and written down in book form.  The true power of the Quran remains in the oral recitation, as it is meant to be read aloud and melodiously, but still the verses were written down on available materials as an aid to memorizing and guarding it, and these were collected and arranged in book form both privately and, at a later stage, institutionally. The Quran was not meant to tell a chronological story, and thus, the Quran should not be viewed as a sequential narrative like the book of Genesis.</p> <p style='margin-bottom: 30px'>The Quran often repeats certain verses and themes, shifting topics between them, and often relates narratives in summarized form.  We can see two reasons for this.  First, it serves a linguistic purpose and is one of the powerful rhetorical techniques of classical Arabic.  Second, all themes of the Quran, no matter how varied, are wrapped around one common thread running through the entire book: there is no true god but Allah, and Muhammad is His messenger.  The Quran, unlike the Bible, is not concerned with genealogies, chronological events, or minute historical details, many of which don’t suit an oral discourse.  The purpose is to use events, from past and present, to illustrate this central message.  So when the Quran is discussing the healing properties of honey or the life of Jesus, neither topic is an end in itself, but each is related in one way or another to the central message – the Oneness of God and unity of the prophetic message.</p> <p>Another important point to keep in mind is that the Quran was not revealed in one sitting, but rather it was revealed in parts over a span of 23 years.  Many passages were in response to specific events.  Often, Quranic revelation would come from the angel Gabriel to Prophet Muhammad as a response to questions raised by unbelievers.  The Quran addresses these unbelievers, the People of the Scripture (a term used by the Quran for Jews and Christians), humanity at large, believers, and, finally, the Prophet himself - commanding him what to do in a certain situation or solacing him in the face of ridicule and rejection.  Knowing the historical and social context of revelation clarifies the meanings contained in the text itself.</p>",
            "text_4": "<p>The Quran is composed of 114 parts or chapters of unequal length.  Each chapter is called a <i>surah</i> in Arabic and each sentence or phrase of the Quran is called an <i>ayah</i>, literally ‘a sign.’ Like the Bible, the Quran is divided into discrete units, referred to as ‘verses’ in English. These verses are not standard in length and where each begins and ends was not decided by human beings, but dictated by God.  Each one is a discrete act of locution of closed signification, or ‘sign’, denoted by the word <i>ayah</i> in Arabic.  All <i>surahs</i>, except one, begin with <i>Bimillah hir-Rahman nir-Rahim</i>, ‘I begin with the Name of Allah, the Most-Merciful, the Compassionate.’ Each <i>surah</i> has a name that usually relates to a central theme within it.  For example, the longest <i>surah</i>, <i>Surah</i> al-Baqarah, or “The Cow”, is named after the story of Moses commanding the Jews to offer a sacrifice of a cow, which begins by God saying:</p> <blockquote>“And remember Moses said to his people: ‘Allah commands that you sacrifice a cow.’” (Quran 2:67)</blockquote> <p>Since the various chapters are of various lengths, the Quran was divided by scholars of the first century after the death of the Prophet into thirty roughly equal parts, each part is called a <i>juz’</i> in Arabic. This division of the Quran was done in order for people to memorize or read it in a more organized fashion, and it has no influence on the original structure, as they are mere marks on the sides of the pages denoting the part.  In the month of fasting, <i>Ramadan</i>, one <i>juz’</i> is usually recited every night, and the entire Quran is completed by the end of the month.</p>",
            "text_5": "<p>What topics does the Quran discuss?  It covers various subjects.  Most importantly, it talks about the Oneness of Allah and how to live a life pleasing to Him.  Other topics include religious doctrine, creation, criminal and civil law, Judaism, Christianity and polytheism, social values, morality, history, stories of past prophets, and science.  The most important features of Quran’s style in discussing these themes are:</p> <ol class='custom-marker parens-around lower-roman'><li>The use of parables to stir curiosity of the reader and explain deep truths.</li> <li>More than two hundred passages begin with the Arabic word <i>Qul</i> - ‘Say’ - addressing Prophet Muhammad to say what follows in reply to a question, to explain a matter of faith, or to announce a legal ruling.  For example: <blockquote style='font-size: 21.92px;'>“Say: ‘O People of the Scripture!  Do you disapprove of us for no other reason than that we believe in Allah, and the revelation that has come to us and that which came before (us), and because most of you are rebellious and disobedient?’”  (Quran 5:59)</blockquote></li> <li>In some passages of the Quran, Allah takes oaths by His marvelous creation, both to strengthen an argument or to dispel doubts in the mind of the listener: <blockquote style='font-size: 21.92px;'>“By the sun and its brightness,<br>By the moon when it follows it,<br>By the day when it displays it,<br>By the night when it covers it,<br>By the sky and He who constructed it,<br>By the earth and He who spread it,<br>By the soul and He who proportioned it…” (Quran 91:1-7)</blockquote> <br>Sometimes Allah takes an oath by Himself: <blockquote style='font-size: 21.92px;'>“But no, by your Lord, they will not (truly) believe until they make you, (O Muhammad), judge concerning that over which they dispute among themselves, and then find within themselves no discomfort from what you have judged and submit in (full, willing) submission.” (Quran 4:65)</blockquote></li> <li>Lastly, the Quran has what is called ‘the disjointed letters,’ composed of letters of the Arabic alphabet which, if taken together, do not have a known meaning in the Arabic lexicon. This was one of the ways that Allah challenged the Arabs, who were the most eloquent of people in speech, to bring forth something to the Quran, which consisted of the likes of these disjointed letters. They appear at the beginning of twenty-nine <i>surahs</i>.  For example, the first <i>aayah</i> of <i>Surah</i> al-Baqarah appears in different translations as: <p style='font-size: 21.92px; line-height: 2.3; margin-top: 30px; text-indent: 0%;'>Yusuf Ali: A.L.M. <br>Pickthal: Alif. Lam. Mim. <br>Muhsin Khan: Alif-Lam-Mim.</p></li></ol>"
        },

        {  
            "id": "L5",
            "title": "Introduction to the Quran: Translation and Explanation of the Quran",
            "header_1": "Arabic Terms",
            "header_2": "Translations of Quran",
            "header_3": "Exegesis (<i>Tafseer</i> in Arabic)",
            "header_4": "",
            "header_5": "",
            "text_1": "<ul><li><i>Salah</i> - the Arabic word to denote a direct connection between the believer and Allah.  More specifically, in Islam it refers to the formal five daily prayers and is the most important form of worship.</li><li><i>Tafseer</i> - exegesis, particularly such commentary on the Quran.</li><li><i>Sunnah</i> - The word <i>Sunnah</i> has several meanings depending on the area of study however the meaning is generally accepted to be, whatever was reported that the Prophet said, did, or approved.</li></ul>",
            "text_2": "<p>A beginner should know a few points about Quran translations.</p> <p>First, there is a distinction between the Quran and its translation.  In Christian view, the Bible is Bible, no matter what language it may be in.  But a translation of the Quran is not the word of Allah, for the Quran is the exact Arabic words spoken by God, revealed to Prophet Muhammad, may the mercy and blessings of Allah be upon him, through Gabriel.  The word of God is only the Arabic Quran as Allah says:</p> <blockquote>“Indeed, I revealed it as an Arabic Quran.” (Quran 12:2)</blockquote> <p>A translation is simply an explanation of the meanings of the Quran.  The translated text loses the inimitable quality of the original so be aware of the degree to which a translation reflects the original message at every level of meaning, and that it will probably not match it.  For this reason, all which is regarded as recitation of the Quran is to be done in Arabic, such as the recitation of the Quran in salah.</p> <p>Second, there is no perfect translation of the Quran and being human works, each almost always has errors.  Some translations are better in their linguistic quality, while others are noted for their exactness in portraying the meaning.  Many inaccurate, and sometimes misleading, translations that are generally not accepted as reliable renditions of the Quran by mainstream Muslims are sold in the market.</p> <p>Third, while a review of all the English translations is out of the scope of this lesson, some translations are recommended over others.  The most widely read English translation is by Abdullah Yusuf ‘Ali, followed by that of Muhammad Marmaduke Pickthall, the first translation by an English Muslim.  Yusuf ‘Ali’s translation is generally acceptable, but his footnote commentary, useful at times, can be odd and unacceptable.  Pickthall, on the other hand, has no footnotes or commentary and that makes it difficult for a beginner.  The language of both tends to be archaic and difficult to understand for some people.  Another widespread translation is done by Dr. Hilali and Muhsin Khan called ‘Interpretation of the Meaning of The Noble Quran.’ Although it is the most accurate, the many transliterated Arabic terms and endless parentheses makes it hard to follow and confusing for a beginner.  A newer version with more flowing text has been published by Saheeh International, and this is probably the best translation yet, as it combines both exactness in translation and readability.</p>",
            "text_3": "<p>Although the meanings of the Quran are easy and clear to understand, one must be careful to make assertions about the religion without relying on an authentic commentary.  Not only did Prophet Muhammad bring the Quran, he also explained it to his companions, and these sayings have been collected and preserved till this day.  Allah, the Exalted, says:</p> <blockquote>“And We have sent down to you (O Muhammad) the message that you may explain clearly to men what is sent for them.” (Quran 16:44)</blockquote> <p>In order to understand some of the deeper meanings of the Quran, one should rely upon commentaries which mention these statements of the Prophet as well as his companions, and not upon what they understand from the text, as their understanding of it is limited to their prior knowledge.</p> <p>A specific methodology exists for exegesis of the Quran in order to extract the proper meaning. The Quranic sciences, as they are called, are an extremely specialized field of Islamic scholarship which requires mastery in multiple disciplines, like exegesis, recitations, script, inimitability, circumstances behind revelation, abrogation, Quranic grammar, unusual terms, jurisprudential rulings, and Arabic language and literature.  A person new to the exploration of Quran should approach it with humility.</p> <p>According to scholars of <i>tafseer</i>, the proper method of explaining the verses of Quran are:</p> <ol class='custom-marker parens-around lower-roman'><li><i>Tafseer</i> of the Quran by Quran.</li> <li><i>Tafseer</i> of the Quran by the Sunnah of the Prophet.</li> <li><i>Tafseer</i> of the Quran by the statements of the Companions.</li> <li><i>Tafseer</i> of the Quran by Arabic language.</li> <li><i>Tafseer</i> of the Quran by scholarly opinion if it does not contradict the above four sources.</li></ol> <p>A final word of advice to the beginner: keep notes, write down what questions arise during your reading, and finally turn to those who have proper knowledge about the religion and accept their explanation if it is based on evidence.</p>",
            "text_4": "",
            "text_5": ""
        },

        {  
            "id": "L6",
            "title": "Paradise",
            "header_1": "Arabic Terms",
            "header_2": "Islamic Gardens",
            "header_3": "The Joys of Paradise",
            "header_4": "Vision of Allah",
            "header_5": "Spouses & Intimacy in Paradise",
            "text_1": "<ul><li><i>Sunnah</i> - The word <i>Sunnah</i> has several meanings depending on the area of study however the meaning is generally accepted to be, whatever was reported that the Prophet said, did, or approved.</li></ul> <p style='margin-top: 30px;'>What drives us?  What makes us do the things we do?  What makes us happy?</p> <p>Many people will answer maximizing pleasure and minimizing pain is the ultimate key to human happiness.</p> <p>If so, how come people can be happy while in pain and unhappy while experiencing pleasure?  If pleasure is not the only motivating force that drives us, what does?  What desires must we fulfill to live a happy life?</p> <p>For most of those who see happiness in the carnal, rather than the spiritual, it is pretty basic: desire to avoid pain and anxiety, desire to spend time with relatives, desire to eat, desire for sexual gratification, desire for companionship, and desire for recognition to name a few.</p> <p>Life for such can be toilsome, provoking the plain query; what is it really aiming for?  In their quest for happiness, all too often people fall short of achieving any kind of inner peace.  We think that by always reaching higher and accomplishing more - more money, a better body, the perfect mate - we will automatically be happy.  That is an illusion.  People get caught up in chasing the materialistic dream under the illusion money can buy happiness until they discover the limits of materialism.  Impressing the neighbors and envy of possessions leaves us devoid of passion and depth in our lives, leading to the Modern Man’s Paradox:  Spiritual hunger in an age of plenty.</p>  <p>What is the paradox?  Simply put, it is this: As members of certain materialistic societies have grown richer, they have grown less content with their lives.  No society in the history of the world has ever enjoyed the standard of living known today in these societies: Incomes are up, prices are stable, unemployment is down, life expectancy is rising; they enjoy more freedom and opportunity than ever before.  Even their poor live well by world standards.  Yet in America, for example, since 1960, the divorce rate has doubled, teen suicide has tripled, violent crime has quadrupled, the prison population has quintupled, and some estimates put the incidence of depression in the year 2000 at ten times what it was in the year 1900.  Americans are less happy today than they were 40 years ago, despite the fact that they make 2.5 times as much money.  Our bellies may be filled, but we are left spiritually hungry.</p> <p>To find out what really drives human behavior, two kinds of happiness must be distinguished: feel-good happiness and value-based happiness.  Feel-good happiness is sensation-based pleasure.  When we joke around or eat our favorite food, we experience feel-good happiness.  This type of happiness rarely lasts longer than a few hours at a time.</p> <p>Value-based happiness is a sense that our lives have meaning and fulfill the larger purpose of our existence by connecting us to Allah.  It represents a spiritual source of satisfaction, stemming from our deeper purpose and values.  Living a God-conscious life rooted in the values of the Quran and <i>Sunnah</i>, a Muslim is driven - beyond sensual pleasures - by the desire to make it to Paradise and to be safe from Hell after death.</p> <p>Islamic values that take a person towards Paradise and away from Hell are the most significant factors in motivating a Muslim’s behavior and in contributing to his or her sense of happiness. The desire to achieve Paradise in the afterlife puts the meaning back into life, superseding all other desires, to bring a sense of direction.  An empty lifestyle focused on wealth, possessions, drugs, alcohol, and sex is replaced with the hope of making it to Paradise, a sense of connection with God’s creation, and a life of devotion to Allah instead of wealth and possessions.  A person is focused on pleasing Allah even at the cost of our fellow human beings' disapproval.  One must remember that the jewel of Paradise is veiled by hardships.</p> <p>To be happy, wake up from materialistic dreams and realize that nothing save Allah alone is capable of satisfying man!</p> <p>Ultimate satisfaction will be in reaching our ultimate goal – Paradise, not in this world, where we are like travelers and strangers.  Paradise is not God’s residence, or a spiritual state where one becomes a part of God, as some mistakenly think.  Paradise is a spiritual and sensual residence of pleasure in which all one’s senses will be gratified to the fullest. It is an abode of manifold enjoyments for the faithful, its dwellers will not feel the least pain or sadness. A place where every aspiration will be finally realized.</p>",
            "text_2": "<p><i>Jannah</i> (a beautiful garden) has historically inspired beauty, something which can be clearly seen in the beautiful gardens which were present throughout the Muslim world, such as those in Persia, Spain, and India, typically designed as a sort of escape or peaceful seclusion from the outside world.  Waterworks and fountains were a common inclusion in Muslim gardens for their free flowing beauty and soothing sound.  Artificial decorative elements were used in Muslim gardens as well, including the making of carpet-like parterres, and artificial trees and flowers made of precious metals and gemstones.</p> <p>For generations of Muslims, these gardens represented a kind of sacred art, the aim of which was to draw the visitor closer to God. Today, the Muslim gardens on earth are like shadows of the true Paradise.  These gardens serve as reminders to mankind of the heavenly abode to which the righteous will return.</p> <p>Shade is provided by canopies and pavilions.  Emphasis is placed on creating a space that indulges all the senses.  Fragrance is a common feature of Muslim gardens, and herbs were potted up to fulfill this role.  The decking provides a space for teaching and relaxing.  Muslim gardens never contain statues, carved stone fountains with figures, or representational sculptures.  Islam does not allow the use of such images.  Some Muslim gardens are so famed for their beauty that people come from far and wide to enjoy their tranquility.  Among them are the Alhambra Palace garden in Granada, Spain, the Jag Mandir Palace garden in India and the Major Elle residence garden in Marrakech, Morocco.</p> <p>The lush gardens created by Muslims are man-made inspirations for an earthly Paradise.  A secret haven secluded from the outside world; a place of tranquility, meditation, reflection, and prayer.  A modest prelude for what it is to come for believers in the Hereafter.</p>",
            "text_3": "<p>Those who enter Paradise will do so in their most perfect, beautiful form.  Their hearts will be one.  They will neither spit, nor blow their noses, or defecate.  They will remain young forever, strong and potent without the inconveniences of body hair.</p> <p>The worldly pleasures pretty much fade in the face of heavenly delights.  The pleasures of this world are fleeting and short-lived, for ‘…short is the enjoyment of this world,’ whereas the joys of Paradise will be unending, as ‘…the provision is eternal.’</p> <p>The fine clothes, delicious foods, soothing drinks, ornate jewels, and grand palaces in Paradise are far superior to what is in this world.  The ‘real estate’ of Paradise is described by the Prophet to be better than the whole world!</p> <p>Paradise is free of any pollutants, foul odors, pain, or discomfort.  The hearts and speech will be pure.  No one will be offended or insulted.</p> <p>The delicious, ripe fruits of Paradise will be within easy reach, ready for its residents to pick whatever fruit one desires.  Any food or drink will be available on demand.  Paradise has seas of water, wine, milk, and honey from which rivers will flow out.  You simply take your pick!  It has fountains scented with camphor and ginger, and shady valleys.  The wine will not cause hangovers.  It is “delight for those who drink”, bringing neither drunkenness nor rousing folly or quarrelling.</p> <P>The inhabitants of Paradise will be served in gold and silver goblets and dishes.  Their finest silk clothes will be decorated with gold, silver, and pearls…better than any man-made garment!  The scent of Musk will emanate from their bodies..  Their palaces will distinguished by refined elegance and be fully furnished.  They will be able to sit and recline in their gardens.  The beautiful bright colored couches will be lined with silk brocade.  Eye catching cushions and splendid carpets will add style and luxury.  A cozy place most people can simply dream of in this world, and  tranquil spot away from distractions;  peaceful, comfortable, and richly decorated.</p> <p>The faithful, who ‘will be served by immortal youths, with cups, and jugs, and a glass from the flowing wine;’ exquisite banquets served in priceless vessels.</p> <p>The faithful will visit one another and reunite with family and friends who made it to Paradise.  All wishes will be fulfilled, some in the strangest ways.  The Messenger of Allah said:</p> <blockquote>“If the believer in Paradise wishes for a child, it will be conceived and delivered, and will grow to the desired age in an instant.” (Al-Tirmidhi)</blockquote> <p>Naturally, running after worldly pleasures at the cost of heavenly delights will be a cause of much sorrow for people who will enter Hell.</p>",
            "text_4": "<p>In heaven the faithful will see Allah, clearly and distinctly.  Here on earth we “see” Him but indirectly through the mirror of creation.</p> <p>In Paradise, no creature will stand between Allah and the faithful who will delight in His glimpse.  The most wonderful melody of all will be the voice of Allah greeting the select.</p> <p>Since in beholding Allah face to face the faithful will find perfect happiness and ultimate delight, the vision may be called “beatific”.  The joy of looking at Him will be greater than any other joy of Paradise, the rivers, palaces, tents of pearl, the pure spouses or the food and drink.  All other joys will pale in comparison to the joy of looking at the most beautiful Face of Allah.</p> <p>He says:</p> <blockquote>“Some faces that Day shall be radiant looking at their Lord.” (Quran 75:22-23)</blockquote> <p>So the faces of the faithful will also radiate and become beautiful with His Light.</p> <p>The Prophet said:</p> <p>“When the people of Paradise enter Paradise, Allah will say, ‘Do you want anything more?’  They will say, ‘Have You not brightened our faces, admitted us to Paradise and saved us from Hell?’  Then the veil will be lifted and they will not have seen anything more dear to them than looking upon their Lord, may He be glorified and exalted.  This is what is meant by ‘even more.’”  Then he recited the verse:</p> <blockquote>“For those who have done good is the best reward and even more (i.e. having the honor of glancing at the Countenance of Allah)” (Quran 10:26)</blockquote> <p>Once you know that the people of Paradise will not be given anything dearer than looking upon the Face of their Lord, imagine the deprivation of the sinners described by Allah:</p> <blockquote>“Nay!  Surely, they (evil doers) will be veiled from seeing their Lord that Day” (Quran 83:15)</blockquote> <p>People said: “O Messenger of Allah, will we see our Lord on the Day of Resurrection?”  The Messenger of Allah, may Allah praise him, said: “Do you doubt that you see the moon on the night when it is full?”  They said, “No, O Messenger of Allah.”  He said, ‘Do you doubt that you see the sun when there is no cloud?”  They said, “No, O Messenger of Allah.”  He said, “You will see Him likewise…”</p> <p>Let us pray to Allah to keep us steadfast in this life and to grant us Paradise from His mercy in the life to come and to grant us His vision.</p>",
            "text_5": "<p>Just as some people can’t perceive colors, so we may be soul-blind and soul-deaf.  The soul’s yearnings simply don’t get through to consciousness; or if they do, we try to numb ourselves to them with medications or frenzied activities.  The resulting alienation within our very hearts bears its own loneliness.  The soul wants to be attached and involved, because it is through such intimacy that it is nourished, initiated, and deepened.  The faithful will enjoy earthly and heavenly spouses in Paradise to satisfy the soul’s cravings for companionship and intimacy.  All the urgencies of the soul – the feeling of longing, the ache of desire for a beautiful, compatible partner, and the urgency to visit old friends – will be met.  The select will rejoice in the company of the parents, spouses and children who were believers.</p> <p>The faithful will be clothed in the richest silks and brocades, and adorned with bracelets of gold and silver, and crowns set with pearls, and will make use of silken carpets, couches, and pillows. In order to enjoy all these pleasures, Allah will grant them perpetual youth, beauty, and vigor.  There is a hadeeth which states that they will enter Paradise “aged thirty-three years.”  It is the most perfect age at which one is most able to enjoy physical pleasures, and the age at which one’s health and strength are most perfect.  It is proven from the Prophet they “will never lose their youth.”</p> <p>The faithful will enter Paradise in the best and most perfect condition in all senses.  They will remain young forever, their eternal delight will be unending, and they will live a life of unspoiled joy.</p> <p>The faithful will enjoy specially crafted maidens, or <i>houris</i>, of Paradise, created not of clay, as in the case of mortal women, but of pure musk, and free from all natural impurities, defects, and inconveniences.  They will be beautiful, modest, and secluded from public view in pavilions of hollow pearls. Thus the body will have its share of gratification.</p>"
        },

        {  
            "id": "L7",
            "title": "Afterlife",
            "header_1": "The Afterlife",
            "header_2": "Death",
            "header_3": "The Life of the Grave",
            "header_4": "Day of Judgment",
            "header_5": "The Eternal Life",
            "text_1": "<table cellspacing=10><tr><td><img style='width: 200px; height: 300px;' src='https://www.mymasjid.ca/wp-content/uploads/2016/10/afterlife-in-islam-1.png' alt='Afterlife'></td> <td style=' padding-left: 30px;'><p>The major religions generally have striking similarities of the journey to the afterlife.</p> <p>The journey of a soul to its Creator is believed from an Islamic perspective to be broken down into four stages; the moment of death, the life in the grave, the day of Judgment, and the Eternal life.</p></td></tr></table> ",
            "text_2": "<p>The inevitability of death is seldom thought about by the average person, whereas our Prophet Muhammad (peace be upon him) informed us to remember and ponder about death often:</p> <img style=' margin: 0 auto 0 auto; display: block;' src='https://www.mymasjid.ca/wp-content/uploads/2016/10/Remember-often-the-destroyer-of-pleasures-muhammad.png'> <p style='margin-top: 30px;'>Death is an inevitable end for any human being. The Quran mentions this point in many verses.</p> <blockquote>“O you who believe! Do not let your wealth or children divert you from the remembrance of Allah. Whoever does that is lost. Give from what We have provided for you before death comes to one of you and he says, ‘O Lord, if only you would give me a little more time so that I can give charity and be one of the righteous.’ Allah will not give anyone more time, once their time has come. Allah is aware of everything you do.” (Quran 63:9-11)</blockquote> <p>And in another verse the Quran reminds us that death will surely come and to prepare for it:</p> <blockquote>“Everyone shall taste death. And only on the Day of Resurrection shall you be paid your wages in full. And whoever is removed away from the fire and admitted to Paradise, he indeed is successful. The life of this world is only the enjoyment of deception (a deceiving thing).” (Quran, 3:185)</blockquote>",
            "text_3": "<p>To get an understanding of what this period of the journey to the Afterlife is like, we will share a story from one of the Companions of Prophet Muhammad (peace be upon him), his friend Uthman.</p> <p>One day a story was narrated by Uthman’s freed slave Hani.</p> <p>Hani narrates that when Uthman would stand in front of a grave he would cry until his beard would become moist.</p> <p>It was once said to Uthman; “You mention Heaven and Hell and you don’t cry yet you cry from this (i.e. the grave)?”</p> <p>Uthman replied; “Allah’s Messenger said: ‘Verily the grave is the first hurdle from the hurdles of the Hereafter (the next life). If one succeeds in it, then what is to come after it will be easier for him. However, if does not succeed in it, then what is to come after it will be harder for him.’”</p> <p>Muslims believe that when a person is buried in their grave, two angels will pay them a visit and ask 3 important questions:<br>“Who is your Lord <br>What is your religion? <br>Who is this man who was sent among you? “</p> <img style=' margin: 0 auto 0 auto; display: block; width: 50%' src='https://www.mymasjid.ca/wp-content/uploads/2016/10/who-is-your-lord-1.jpg'> <p style='margin-top: 30px;'>The good soul will able to answer each question respectively; “Allah, Islam, and Muhammad.” Whereas the evil soul, although they may have known these answers in this life, will not be able to respond to these questions and will instead say: “Oh, oh, I do not know”.</p> <p>It is after the questioning of the angels that a life of either blessings or torment will begin for the soul. The good soul will have a life of goodness for eternity in Heaven. As for the evil soul, it will have an eternal life in Hell. What determines whether a person will end up in Hell or Heaven is based on two things: their beliefs and their deeds. Muslims believe that if a person believes in Islam and performs more good deeds than sins, then they will have a good ending in the afterlife.</p>",
            "text_4": "<p>The Day of Judgement is called by many names in Islam such as the Day of Recompense, the Day of Rising, and the Hour.</p> <p>The Hour is one of the many pieces of knowledge which no one besides Allah possesses. Only Allah (Exalted and High) knows when it will arise.</p> <blockquote>People ask you (O Muhammad) concerning the Hour. Say, ‘Knowledge of it is only with Allah. What do you know? Perhaps the Hour is near.’ Quran, 33:63)</blockquote> <p>We will discuss the many scenes that will happen on the day of reckoning through the Book of Allah (Exalted and High) and the sayings of our Noble Prophet Muhammad (peace be upon him).</p> <img style='margin: 0 auto 0 auto; display: block; width: 40%;' src='https://www.mymasjid.ca/wp-content/uploads/2016/10/on-the-day-of-judgement-1-1.png'> <p style='margin-top: 30px;'>Allah will order one of His Angels, Israfeel, to blow a special horn and at that moment everything in existence will come to an end. Allah painted vivid pictures in the Noble Quran of this day in a number of verses.</p> <blockquote>And the Horn will be blown, and whoever is in the heavens and whoever is on the earth will fall dead except whom Allah wills. Then it will blown a second time and behold, they will be standing, looking on (waiting). (Quran, 39:68)</blockquote> <p>When the Hour comes every human being will only think about themselves. For example, mothers will forget about their children, brothers and sisters will forget about their siblings, and friends will forget about their closest companions. Every human will only worry about their own salvation because of the terrors of the Day of Judgement.</p> <p>All of mankind from the first generation to the last generation will all be gathered on a great plain. The sun will be brought much closer and everyone will be sweating except those whom Allah grants His Shade. This great day will feel like fifty thousand years according to the words of Prophet Muhammad (peace be upon him). The hearts of man will be in terror, not knowing what the outcome will be. And soon thereafter the judgement will begin. Everyone’s deeds will be accounted for and judged by Allah.</p> <blockquote>On the Day when every person will be confronted with all the good he has done, and all the evil he has done, he will wish that there were a great distance between him and his evil. And Allah warns you against Himself (His Punishment) and Allah is Kind to (His) servants. (Quran, 3:30)</blockquote> <p>After the judgment is complete there will be a party of people admitted into Paradise and a party of people admitted into Hell. And then the eternal life begins.</p>",
            "text_5": "<p>After being judged by the Most Just, Allah (Exalted and High), everyone will be admitted into their eternal home. Allah will admit the dwellers of the Hell into the Hell (May Allah protect us from that) and admits the dwellers of Paradise into Paradise (May Allah make us among them).</p> <p>The dwellers of Hell will have the worst imaginable punishment. Allah says:</p> <blockquote>So taste (of that which you have earned), and never will We increase you except in torment. (Quran, 78:30)</blockquote> <p>The dwellers of Paradise will be given every type of pleasure. Rivers of water, milk, wine and honey will flow under perfect gardens and golden mansions. The Prophet (peace be upon him) said:</p> <img style='margin: 0 auto 0 auto; display: block; width: 50%;' src='https://www.mymasjid.ca/wp-content/uploads/2016/10/righteous-servants-in-islam.png'> <p style='margin-top: 30px'>Imagine having beaches in palaces made of gold and silver.</p> <p>Imagine having palm trees coming out in the middle of golden tables which every type of fruit comes from.</p> <p>Imagine beautiful mountains surrounding your palace and having conversations with believers from all generations of mankind. Imagine being with your loved ones, sharing stories with one another and tasting the best wine with no intoxication.</p> <p>What the Prophet (peace be upon him) meant by the statement above is that Paradise will be full of things we can imagine. He also goes on to say that whatever we could possibly imagine, the reward that Allah has prepared is <b>even greater than that</b>.</p> <p>We can imagine all we want and yet, what lies in Paradise has never been thought of by any human heart or mind.</p>"
        }
    ]
},



    {   
        "mod_id": "2",
        "mod_header": "The Beginner's Guide to Learning How To Pray",
        "mod_img": "https://www.mymasjid.ca/wp-content/uploads/2017/12/How-to-Pray-Salah.jpg",

        "lessons": [
        {
            "id": "L1",
            "title": "How to Pray: Ablution (Wudoo)",
            "header_1": "Arabic Terms",
            "header_2": "The Virtues of Ablution",
            "header_3": "The Method of Performing Ablution",
            "header_4": "",
            "header_5": "",
            "text_1": "<ul><li><i>Nafl</i> - a voluntary act of worship</li> <li><i>Hadith</i> - (plural – <i>ahadith</i>) is a piece of information or a story. In Islam it is a narrative record of the sayings and actions of Prophet Muhammad and his companions.</li> <li><i>Wudoo</i> – ablution.</li></ul>",
            "text_2": "<p>By the ultimate grace of Allah, He commands us with certain obligations, and then also rewards us for their fulfillment. Performing ablution as well has many virtues associated with it, from forgiveness of sins to it being a mark of recognition on the Day of Judgment. The following are an example of some of the <i>ahadith</i> which mention these rewards.</p> <p style='text-indent: 0%'>(1)  Messenger of Allah, may the mercy and blessings of Allah be upon him, said:</p> <p style='text-indent: 0%'><b>“When a Muslim or a believer performs ablution and washes his face, every lesser sin that he committed as a result of looking washes away with water (or with the last drop of water). When he washes his hands, every sin that his hands committed washes away with water (or with the last drop of water). When he washes his feet, every sin to which he proceeded washes away with water (or with the last drop of water) until he emerges pure and sin free..” (<i>Muslim</i>)</b></p> <p style='text-indent: 0%'>(2)  Messenger of Allah said:</p> <p style='text-indent: 0%'><b>“Shall I inform you (of an act) by which Allah erases sins and raises degrees?  They (his Companions) said, ‘Certainly, O Messenger of Allah.’  He said, ‘Perfecting the ablution under difficult circumstances, taking many steps to the mosque, and waiting for the (next) prayer after the (last) prayer has been performed.  That is ribat.’” (<i>Saheeh Muslim</i>)</b></p> <p style='text-indent: 0%'>(3)  Messenger of Allah passed by a grave site and said:</p> <p style='text-indent: 0%'><b>“Peace be upon you, the abode of the believing people, and soon we as well, if Allah so wills, are about to join you. I love to see my brothers.”</b></p> <p style='text-indent: 0%'><b>They (his Companions) said: “Aren’t we your brothers, O Messenger of Allah?”</b></p> <p style='text-indent: 0%'><b>He said: “You are my Companions; our brothers are those who have not yet come into the world.”</b></p> <p style='text-indent: 0%'><b>They said: “O Messenger of Allah, how would you recognize those persons of your nation [on the Day of Judgment] who have not yet been born?”</b></p> <p style='text-indent: 0%'><b>He replied: “Suppose a man had horses with white blazes on their foreheads and legs among other horses which were all black. Tell me, would he not recognize his own horses?”</b></p> <p style='text-indent: 0%'><b>They said: “Certainly, O Messenger of Allah.”</b></p> <p style='text-indent: 0%'><b>He said: “They [those who have not come yet] will come with white faces, arms and legs owing to ablution, and I will arrive at the Cistern  before them. Some people will be driven away from my Cistern as a stray camel is driven away. I will call out: ‘Come, come.’ Then it will be said (to me): ‘These people changed [the religion by innovating in it] after you,’ and I will say: ‘Be off, be off.’” (<i>Saheeh Muslim</i>)</b></p> <p>On the Day of Judgment, the Muslim nation will be distinguished from other nations by the body parts which they washed for ablution which will be emanating with light:</p> <p style='text-indent: 0%'><b>“My people will be called to presence on the Day of Judgment with bright faces, arms and legs from the traces of ablution.” (<i>al-Bukhari</i>)</b></p>", 
            "text_3": "<p>Allah, the Exalted, says in the Quran:</p> <blockquote>“O you who believe! When you intend to offer the prayer, wash your faces and from your hands up to the elbows, wipe your heads, and wash your feet up to the ankles.” (Quran 5:6)</blockquote> <p>Prophet Muhammad also said:</p> <p style='text-indent: 0%'><b>“Allah does not accept any prayer performed without being in a state of purity.” (<i>Muslim</i>)</b></p> <p>The Prophet practically taught us how to perform ablution, as he was sent to explain the revelation of the Quran. The following is a step by step guide explaining what exactly is to be washed and how, gathered from various texts of <i>hadith</i>.</p> <ol class='custom-marker parens-around lower-roman'><li>Before you perform ablution, you should make sure your body parts are not soiled with impurities. You must have the intention of purifying yourself from a state of ritual impurity.  This means that you should bring into your mind that you are performing this <i>wudoo</i> in order to enter a state of ritual purity for <i>salah</i>. This intention is in the heart and is not to be uttered.</li> <li>Begin with the name of Allah, by saying <i>‘Bismillaah’</i>.</li> <li>Then, wash your hands three times each. You should always start with the right whenever washing the body parts..</li> <li style='min-height: 16em'><img style='float: right; margin-left: 1em; width: 30%;' src='https://www.newmuslims.com/upload/lessons/images/How_to_Pray_for_a_Recent_Convert_(part_1_of_2)._001.jpg'>Rinse your mouth three times, swirling the water around inside your mouth (gargling), and then rinse your nose three times by inhaling some water into your nostrils and blowing the water out. Use your left hand to remove the water from your nose.</li> <li style='min-height: 16em;'><image style='float: right; margin-left: 1em; width: 30%;' src='https://www.newmuslims.com/upload/lessons/images/How_to_Pray_for_a_Recent_Convert_(part_1_of_2)._003.jpg'>Wash your face three times, from the hairline to the jawbone and chin, and from ear to ear.  A man should wet the hair of his beard because it is part of the face.  If his beard is thin he has to wash it inside and out, and if it is thick and covers the skin, it is sufficient to wash the surface and run his wet fingers through it.</li> <li style='min-height: 16em'><img style='float: right; margin-left: 1em; width: 30%;' src='https://www.newmuslims.com/upload/lessons/images/How_to_Pray_for_a_Recent_Convert_(part_1_of_2)._004.jpg'>Then you should wash your hands and arms up to the elbows three times, starting from the fingertips, including the nails, up to and including the elbows.  It is essential to remove anything stuck to the hands before washing them, such as dough, mud, or paint, nail polish, and anything else that could prevent the water from reaching the skin.</li> <li style='min-height: 16em'><img style='float: right; margin-left: 1em; width: 30%;' src='https://www.newmuslims.com/upload/lessons/images/How_to_Pray_for_a_Recent_Convert_(part_1_of_2)._005.jpg'>Then, with fresh water, wipe your head and ears one time, not the water left over from washing your arms.  The way to wipe the head is by placing your wet hands at the front of your head and passing them over your hair/head until you reach the back of your head (the nape of your neck), then bringing them back to the place where you started.  You may see some people wiping the backs of their necks as well. This is something which has found its way into the practice of Muslims from countries and should not be done, as the Prophet did not teach us to do so. Then put your index fingers in your ears and wipe the back of the ears with your thumbs.  With regard to long hair, whether loose or braided, one is not to wipe its entire length, but rather pass their hands from the front of the head to its back, as described above.</li> <li style='min-height: 13em;'><img style='float: right; margin-left: 1em; width: 30%;' src='https://www.newmuslims.com/upload/lessons/images/How_to_Pray_for_a_Recent_Convert_(part_1_of_2)._007.jpg'>Then you should wash your feet three times, from the tips of the toes up to and including the ankles.</li> <li>You must maintain the correct order in washing the body parts, and do so in succession, not taking a long pause between each body part.</li></ol> <p>Those body parts which we mentioned to wash thrice may be washed twice or once only, but those which we mentioned to wipe once (the head and the ears) may only we wiped once and not more.</p> <p>Men and women are to perform wudoo in the same manner. As most of you probably work, it’s a good idea to learn how to wipe over the socks to save you the trouble of taking off your socks at work. It basically involves wetting the hands and passing them over the tops of the socks (the foot part and not the leg).</p> <p>The evidence for the method of performing ablution is the <i>hadith</i> narrated of Ali:</p> <p style='text-indent: 0%'><b>“After praying the Fajr prayer, ‘Ali entered and sat in terrace, and then said to a young boy: ‘Bring me some water for ablution.’ The boy brought him a bowl of water and a basin. ‘Abd Khair said ‘We were sitting and watching him.’ He said: He held the vessel with his right hand and poured [water] into his left, and washed his hands up to the wrist. Then he [again] held the vessel with his right hand and poured [water] into his left, and washed his hands up to the wrist. He never put his hands inside the bowl until he washed both hands thrice.</b></p> <p style='text-indent: 0%'><b>Then he put his right hand in the bowl and rinsed his mouth and nose three times, expelling the water from his nose with the help of his left hand.</b></p> <p style='text-indent: 0%'><b>He washed his face thrice, his right hand to the elbow thrice, and then his left hand to the elbow thrice.</b></p> <p style='text-indent: 0%'><b>He then put his right hand into the bowl until it was immersed in the water, took it out and wiped his left hand with whatever water was on it, then he wiped his head with both hands once.</b></p> <p style='text-indent: 0%'><b>He poured water with his right hand over his right foot thrice, washing it with his left hand, and then poured water with his right hand over his left foot thrice, washing it with his left hand [as well].</b></p> <p style='text-indent: 0%'><b>Then he put his hand into the bowl, took some water up into his palm and drank it. He then said, ‘This is how the Prophet of Allah performed ablution. Whoever would like to see how he used to perform ablution, this is it.’” [<i>Saheeh ibn Hibban</i>]</b></p> <p>Over time, you can learn these prayers which the Prophet himself said and also encouraged us to say after completing ablution (<i>wudoo</i>).</p> <ol class='numbers'><li><i>“Ash’hadu an laa ilaha ill-Allah, wahdahu laa shareeka lah, wa ash’hadu anna Muhammadan abduhu wa rasooluh.”</i> <br>“I bear witness that none has the right to be worshipped except Allah, alone, without partner, and I bear witness that Muhammad is His slave and Messenger.”</li> <li><i>“Allahummaj’alni min at-tawwabeena waj-alni min al-mutatahhireen.”</i> <br>“O Allah, make me of those who return to You often in repentance and make me of those who remain clean and pure.”</li> <li><i>“Subhaanak Allahumma wa bihamdik, ash’hadu an laa ilaha illa ant, astaghfiruka wa atoobu ilaik.”</i> <br>“How perfect You are O Allah, and I praise You, I bear witness that none has the right to be worshipped except You, I seek Your forgiveness and turn in repentance to You.’</li></ol>",
            "text_4": "",
            "text_5": ""
        },

        {
            "id": "L2",
            "title": "How to Pray: Prayer (Salah)",
            "header_1": "Arabic terms",
            "header_2": "What is Prayer (<i>Salah</i>)?",
            "header_3": "Getting Ready for Prayer (<i>Salah</i>)",
            "header_4": "The Prayer (<i>Salah</i>)",
            "header_5": "",
            "text_1": "<ul><li><i>Wudoo</i> – ablution.</li> <li><i>Salah</i> - the Arabic word to denote a direct connection between the believer and Allah.  More specifically, in Islam it refers to the formal five daily prayers and is the most important form of worship.</li> <li><i>Ghusl</i> – ritual bath.</li> <li><i>Fajr, Dhuhr, Asr, Maghrib, Isha</i> – the names of five daily prayers in Islam.</li></ul>",
            "text_2": "<p>Prayer (<i>Salah</i>) is the formal establishment of prayer required of a Muslim five times daily.</p> <p>Prayer (<i>Salah</i>) consists of specific statements and actions.</p>",
            "text_3": "<p><b>The timings:</b>  The five daily prayers have to be offered within a certain time range. They are Fajr, Dhuhr, Asr, Magrib and Isha, and you can find them at our <a href='http://127.0.0.1:5500/WorkingCode/Prayer/PrayerTime.html'>Prayer Schedule</a>.</p> <p>The timings of the prayers vary from place to place. And this is why you need to find the prayer timings for your specific city.<p> <p>The prayers do not need to be prayed exactly when the time starts; rather, they can be prayed at any time before the next prayer time starts, with the exception of Fajr and Isha.  The Fajr prayer should be prayed before sunrise. For this reason, you will find the time for sunrise listed on Prayer schedules, and this does not mean that there is a special prayer for Sunrise.  And the <i>Isha</i> prayer should be prayed till the middle of the night. However, due to necessity, the <i>Isha</i> prayer can be prayed up to the beginning of <i>Fajr</i> time.</p>  <p><b>The direction:</b> You can use the same website to find the direction of prayers. The website will display the bearing on a compass after you have entered your city.</p> <p><b>The dress:</b> A Muslim man should wear something that at least covers him from the navel to the knees. A Muslim woman must wear loose clothing that covers her entire body and hair leaving her face and palms open.</p> <p><b>State of Purity:</b> One should be in a state of purity, by performing ablution (<i>wudoo</i>) or ritual bath (<i>ghusl</i>). Also one should make sure that there is no impurity on one’s clothes or body. The prayers can be done on any clean surface such as the floor, carpet or a rug. Dust, mud or grease are considered ok and do not affect the prayers.</p>",
            "text_4": "<p>The Prayer (<i>salah</i>) is to be said in Arabic and requires some memorization, so, it usually takes a little time to learn correctly and fully and get used to it.  Not knowing Arabic should not discourage you; just pray the prayer (<i>salah</i>) to the best of your ability.</p> <p>A new Muslim has to realize that the orders of Allah are to be followed within the limit of his or her ability and endurance.  If you find it difficult to memorize all of what is necessary for the prayers, it may be a good idea in the meantime to write it on a piece of paper and read them in prayer.  If you are unable to do even this, it is sufficient that you click to listen and say any or all of the following instead:</p> <ul style='line-height: 2.3'><li><i class='play' onclick='playSound1()'>Subhanallah</i> <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>‘How Perfect is Allah!’</b></span></li> <li><i class='play' onclick='playSound2()'>Al-hamdu lil-lah</i> <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>‘All praise and thanks are for Allah’</b></span></li> <li><i class='play' onclick='playSound3()'>La ilaha il-lal-lah</i> <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>‘There is no god except Allah’</b></span></li> <li><i class='play' onclick='playSound4()'>Allahu Akbar</i> <span>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b>‘Allah is the Greatest’</b></span></li></ul> <p style='margin-top: 30px;'>Here is an example of a <b>2 unit prayer</b> (like the <i><b>Fajr</b></i> prayer), based on the last method of prayers explained above.</p> <ol class='custom-marker parens-around lower-roman'><li>Stand straight facing the direction of prayer.</li> <li style='min-height: 12em'><img style='float: right; margin-left: 1em; width: 20%;' src='https://www.newmuslims.com/upload/lessons/images/How_to_Pray_for_a_Recent_Convert_(part_2_of_2)._001.jpg'>Raise your hands up to the shoulders and say <i class='play' onclick='playSound4()'>Allahu Akbar</i>.</li> <li style='min-height: 12em'><img style='float: right; margin-left: 1em; width: 20%;' src='https://www.newmuslims.com/upload/lessons/images/How_to_Pray_for_a_Recent_Convert_(part_2_of_2)._002.jpg'>Then place your right arm over your left arm and place both of them on the chest. In the standing position, say <i class='play' onclick='playSound1()'>Subhanallah</i>.</li> <li style='min-height: 12em'><img style='float: right; margin-left: 1em; width: 20%;' src='https://www.newmuslims.com/upload/lessons/images/How_to_Pray_for_a_Recent_Convert_(part_2_of_2)._003.jpg'>Then say <i class='play' onclick='playSound4()'>Allahu Akbar</i> and go to the bowing position. In the bowing position say <i class='play' onclick='playSound1()'>Subhanallah</i>.</li> <li style='min-height: 12em'><img style='float: right; margin-left: 1em; width: 20%;' src='https://www.newmuslims.com/upload/lessons/images/How_to_Pray_for_a_Recent_Convert_(part_2_of_2)._004.jpg'>Then get up from the bowing position to stand straight again. Say <i class='play' onclick='playSound4()'>Allahu Akbar</i> while getting up. Here say <i class='play' onclick='playSound1()'>Subhanallah</i>.</li> <li style='min-height: 12em'><img style='float: right; margin-left: 1em; width: 20%;' src='https://www.newmuslims.com/upload/lessons/images/How_to_Pray_for_a_Recent_Convert_(part_2_of_2)._005.jpg'>Then go to the position of prostration. Say <i class='play' onclick='playSound4()'>Allahu Akbar</i> while going down. In the position of prostration say <i class='play' onclick='playSound1()'>Subhanallah</i>.</li> <li style='min-height: 12em'><img style='float: right; margin-left: 1em; width: 20%;' src='https://www.newmuslims.com/upload/lessons/images/How_to_Pray_for_a_Recent_Convert_(part_2_of_2)._006.jpg'>Then come to the sitting position. While sitting up, say <i class='play' onclick='playSound4()'>Allahu Akbar</i>. In the sitting position say <i class='play' onclick='playSound1()'>Subhanallah</i>.</li> <li>Then again go to the position of prostration.  Say <i class='play' onclick='playSound4()'>Allahu Akbar</i> while going down. In the position of prostration say <i class='play' onclick='playSound1()'>Subhanallah</i>.</li> <li>Stand up again while saying <i class='play' onclick='playSound4()'>Allahu Akbar</i> and repeat Step iii to viii.</li> <li>Then come to the sitting position. While sitting up, say <i class='play' onclick='playSound4()'>Allahu Akbar</i>. In the sitting position say <i class='play' onclick='playSound1()'>Subhanallah</i>.</li> <li style='min-height: 12em'><img style='float: right; margin-left: 1em; width: 20%;' src='https://www.newmuslims.com/upload/lessons/images/How_to_Pray_for_a_Recent_Convert_(part_2_of_2)._008.jpg'> <img style='float: right; margin-left: 1em; width: 20%;' src='https://www.newmuslims.com/upload/lessons/images/How_to_Pray_for_a_Recent_Convert_(part_2_of_2)._007.jpg'> Then conclude the prayer by turning your head to the right then left, each time saying <i class='play' onclick='playSound5()'>As-salaamu alaikum</i></li> </ol><p>Here is an example of a <b>3 unit prayer</b> (like the <i>Magrib</i> prayer):</p> <p>Do steps (i) to (x), and then stand up again while saying <i class='play' onclick='playSound4()'>Allahu Akbar</i> and repeat Steps (iii) to (viii) and then steps (x) and (xi).</p> <p>Here is an example of a <b>4 unit prayer</b> (like the <i>Dhuhr, Asr and Isha</i> prayer):</p> <p>Do steps (i) to (x), and then stand up again while saying <i class='play' onclick='playSound4()'>Allahu Akbar</i> and repeat Steps (iii) to (xi).</p> <p>This way of performing prayers is permissible for you until you can pray the actual prayer which can be done with the help of reading the prayers from a piece of paper.</p>",
            "text_5": ""
        },

        {
            "id": "L3",
            "title": "Adhan: The Call to Prayer",
            "header_1": "Arabic Terms",
            "header_2": "Introduction and History of Adhan",
            "header_3": "The Virtues of the Adhan and How is the Adhan called?",
            "header_4": "",
            "header_5": "",
            "text_1": "<ul><li><i>Adhan</i> - an Islamic way of calling Muslims to the five obligatory prayers.</li> <li><i>Iqamah</i> - This word refers to the second call to prayer that is given immediately before the prayer begins.</li> <li><i>Shirk</i> - a word that implies ascribing partners to Allah, or ascribing divine attributes to other than Allah, or believing that the source of power, harm and blessings comes from another besides Allah.</li> <li><i>Salah</i> - the Arabic word to denote a direct connection between the believer and Allah.  More specifically, in Islam it refers to the formal five daily prayers and is the most important form of worship.</li> <li><i>Tawheed</i> - The Oneness and Uniqueness of Allah with respect to His Lordship, His Names and Attributes and in His right to be worshipped.</li> <li><i>Hadith</i> - (plural – <i>ahadith</i>) is a piece of information or a story. In Islam it is a narrative record of the sayings and actions of Prophet Muhammad and his companions.</li> <li><i>Fajr</i> - the morning prayer.</li></ul>", 
            "text_2": "<p>Linguistically, the term <i>Adhan</i> means “a proclamation”, and this is what is meant in the verse of the Quran:</p> <blockquote>“And a <i>proclamation</i> (adhan) from Allah and His messenger to all people on the day of the Greater Pilgrimage that Allah is free from (all) obligations to the polytheists, and so is His messenger.” (Quran 9:3)</blockquote> <p>In religious context, the <i>adhan</i> is that proclamation made, consisting of specific “words of remembrance”, the time for an obligatory salah has begun. Throughout the Muslim world and in some places in the West, the caller to prayer announces five times a day from every mosque that it is time for prayer, to remember Allah, and to put aside all the cares of life to prepare for the worship of the Giver of Life.  The prayer “God is the Greatest” resonates through all semblances of civilization, through small towns to metropolises. <p>The <i>adhan</i> covers all the essentials of the Islamic faith in a few words:</p> <img style='float: right; margin-left: 1em; width: 40%;' src='https://www.newmuslims.com/upload/lessons/images/Azhan_(part_1_of_2)_-_The_Call_to_Prayer_001.jpg'><ol class='numbers'><li>It begins by proclaiming the greatness of Allah.</li> <li>It testifies to Allah’s <i>tawheed</i> and His exclusive right to worship.</li> <li>It denies <i>shirk</i> – the worship of everything besides Allah.</li> <li>The <i>adhan</i> testifies that Muhammad, may the mercy and blessings of Allah be upon him, is the Messenger of Allah.</li> <li>It mentions belief in one of the greatest pillars of Islam: the <i>salah</i> (ritual prayer).</li> <li>Invites to the prayer and equates it with prosperity, salvation and success (in the hereafter).</li> <li>It affirms the reward for <i>salah</i>: prosperity for one who singles out Allah in <i>tawheed</i>, follows His Messenger, establishes the <i>salah</i> and other pillars of Islam.</li> <li>It implies the loss of one who does not respond to the <i>adhan</i> and does not pray.</li></ol> <p>The <i>adhan</i> was prescribed during the first year after the Prophet migration to Medina.  It was taught in true visions to two companions and made part of Muslim life by the Prophet himself.  Abdullah ibn Zaid, a companion of the Prophet, reported:</p> <p style='text-indent: 0%; font-weight: bold;'>“When the Prophet was to order the use of a bell to call the people to prayer, he disliked it because it resembled the Christian practice.  While I was sleeping, a man came to me carrying a bell.  I said to him, ‘O slave of Allah, will you sell me that bell?’</p> <p style='text-indent: 0%; font-weight: bold;'>He said, ‘What would you do with it?’</p> <p style='text-indent: 0%; font-weight: bold;'>I replied, ‘I would call the people to prayer with it.’</p> <p style='text-indent: 0%; font-weight: bold;'>He responded, ‘Shall I not guide you to something better than that?’</p> <p style='text-indent: 0%; font-weight: bold;'>I said, ‘Certainly.’</p> <p style='text-indent: 0%; font-weight: bold;'>He said, ‘You should say:</p> <p style='text-indent: 0%; font-weight: bold; font-style: italic;'>Allahu akbar, Allahu akbar, Allahu akbar, Allahu akbar</p> <p style='text-indent: 0%; font-weight: bold; font-style: italic;'>Ashhadu alla ilaha illal-lah, ashhadu alla ilaha illal-lah</p> <p style='text-indent: 0%; font-weight: bold; font-style: italic;'>Ashhadu anna Muhammad ar-Rasool-lal-lah,</p> <p style='text-indent: 0%; font-weight: bold; font-style: italic;'>ashhadu anna Muhammadar-Rasool-lal-lah</p> <p style='text-indent: 0%; font-weight: bold; font-style: italic;'>Hayya ‘alas-salah, hayyah ‘alas-salah</p> <p style='text-indent: 0%; font-weight: bold; font-style: italic;'>Hayya ‘alal-falah, hayya ‘alal-falah</p> <p style='text-indent: 0%; font-weight: bold; font-style: italic;'>Allahu akbar, Allahu akbar. La ilaha illal-lah.’</p> <p style='text-indent: 0%; font-weight: bold;'>Then he went a short distance away and said, ‘When you stand for the prayer, say:</p> <p style='text-indent: 0%; font-weight: bold; font-style: italic;'>Allahu akbar, Allahu akbar</p> <p style='text-indent: 0%; font-weight: bold; font-style: italic;'>Ashhadu alla ilaha illal-lah</p> <p style='text-indent: 0%; font-weight: bold; font-style: italic;'>Ashhadu anna Muhammad ar-Rasool-lal-lah</p> <p style='text-indent: 0%; font-weight: bold; font-style: italic;'>Hayya ‘alas-salah, hayya ‘alal-falah</p> <p style='text-indent: 0%; font-weight: bold; font-style: italic;'>Qad qaamatis-salah, qad qaamatis-salah</p> <p style='text-indent: 0%; font-weight: bold; font-style: italic;'>Allahu akbar, Allahu akbar. La ilaha illal-lah.’</p> <p style='text-indent: 0%; font-weight: bold;'>When the morning came, I went to the Messenger of Allah to tell him what I had seen.  He said, ‘Your dream is true, Allah willing.  Go to Bilal, tell him what you have seen, and tell him to make the call to prayer, for he has the best voice among you.’ I went to Bilal and told him what to do, and he made the call to prayer.  ‘Umar was in his house when he heard it.  He came out with his cloak, saying ‘By the One who has raised you with the truth, I saw similar to what he saw.’ The Prophet said, ‘All praise is to Allah.’”</p> <p>The Prophet appointed two companions to call the <i>adhan</i> in Medina in his mosque: Bilal, a former African slave whose freedom was bought by Abu Bakr, and Ibn Umm Maktum for the adhan of <i>Fajr</i>.  He also appointed Abu Mah-zura in Mecca and Sa’ad al-Qaraz in Quba’.</p>",
            "text_3": "<p><span style='font-size: 1.4em;'>The Virtues of the Adhan</span><br>Many <i>ahadith</i> of our Prophet Muhammad describe the virtues of the <i>adhan</i> and the one who calls it:</p> <ol class='numbers'><li>“If the people knew what was in the <i>adhan</i> and the first row (of the prayer in virtue), and that they could not get it save by drawing lots, they would draw lots.”</li> <p>The meaning of this <i>hadith</i> is that if the people knew the abundant reward in calling the <i>adhan</i>, and could not find any way to call the adhan except by drawing lots, then they would do that to attain its virtue.</p> <li>“The callers to prayer will have the longest necks of all people on the Day of Resurrection.”</li> <p>This meaning of this <i>hadith</i> is explained to be that they will be masters and leaders, as the Arabs describe leaders as having long necks, or it means they will have the most good deeds to their credit.</p> <li>“Allah and His angels send blessings upon the front row, and the caller to prayer is forgiven as far as his voice reaches, and whatever hears him, animate or inanimate, confirms what he says, and he will have a reward like that of those who pray with him.”</li> <li>“Your Lord, the Exalted, is amazed (and pleased) by one who is watching sheep in his pasture, then goes to the mountain to make the call to prayer and pray.  Allah, the Exalted, says, ‘Look at my slave there who makes the call to prayer and establishes the prayer out of fear of Me.  I have forgiven my slave and have allowed him to enter Paradise.’”</li> <li>“The imam is a guarantor, and the caller to prayer is one who is given the trust.  O Allah, guide the imam and forgive the caller to prayer.”</li> <li>“Whoever gives the call to prayer for twelve years will be guaranteed Paradise, and for each day sixty good deeds will be recorded for him by virtue of his <i>adhan</i>, and thirty good deeds by virtue of his iqama.”</li></ol> <p><span style='font-size: 1.4em;'>How is the <i>Adhan</i> Called?</span><br>Here are the wordings of the <i>adhan</i>:</p> <p style='text-indent: 0%;'><i>Allahu akbar</i> <br>Allah is the Greatest</p> <p style='text-indent: 0%;'><i>Allahu akbar</i> <br>Allah is the Greatest</p> <p style='text-indent: 0%;'><i>Allahu akbar</i> <br>Allah is the Greatest</p> <p style='text-indent: 0%;'><i>Allahu akbar</i> <br>Allah is the Greatest</p> <p style='text-indent: 0%;'><i>Ashhadu alla ilaha illal-lah</i> <br>I testify there is no true god but Allah</p> <p style='text-indent: 0%;'><i>Ashhadu alla ilaha illal-lah</i> <br>I testify there is no true god but Allah</p> <p style='text-indent: 0%;'><i>Ashhadu anna Muhammad ar-Rasool-lal-lah</i> <br>I testify that Muhammad is the Messenger of Allah</p> <p style='text-indent: 0%;'><i>Ashhadu anna Muhammad ar-Rasool-lal-lah</i> <br>I testify that Muhammad is the Messenger of Allah</p> <p style='text-indent: 0%;'><i>Hayya ‘alas-salah</i> <br>Come to prayer</p> <p style='text-indent: 0%;'><i>Hayya ‘alas-salah</i> <br>Come to prayer</p> <p style='text-indent: 0%;'><i>Hayya ‘alal-falah</i> <br>Come to success</p> <p style='text-indent: 0%;'><i>Hayya ‘alal-falah</i> <br>Come to success</p> <p style='text-indent: 0%;'><i>Allahu akbar</i> <br>God is the Greatest</p> <p style='text-indent: 0%;'><i>Allahu akbar</i> <br>God is the Greatest</p> <p style='text-indent: 0%;'><i>La ilaha illal-lah</i> <br>There is no true god but Allah</p>",   
            "text_4": "",
            "text_5": ""
        },

        {
            "id": "L4",
            "title": "Friday Prayer",
            "header_1": "",
            "header_2": "",
            "header_3": "",
            "header_4": "",
            "header_5": "",
            "text_1": "",
            "text_2": "",
            "text_3": "",
            "text_4": "",
            "text_5": ""
        },

        {  
            "id": "L5",
            "title": "Supplication",
            "header_1": "",
            "header_2": "",
            "header_3": "",
            "header_4": "",
            "header_5": "",
            "text_1": "",
            "text_2": "",
            "text_3": "",
            "text_4": "",
            "text_5": ""
        },

        {  
            "id": "L6",
            "title": "Common Mistakes to Avoid",
            "header_1": "Arabic Terms",
            "header_2": "",
            "header_3": "",
            "header_4": "",
            "header_5": "",
            "text_1": "",
            "text_2": "",
            "text_3": "",
            "text_4": "",
            "text_5": ""
        },

        {  
            "id": "L7",
            "title": "Importance of Seeking Knowledge",
            "header_1": "Arabic Terms",
            "header_2": "",
            "header_3": "",
            "header_4": "",
            "header_5": "",
            "text_1": "",
            "text_2": "",
            "text_3": "",
            "text_4": "",
            "text_5": ""
        }
    ]
    },



{   
    "mod_id": "3",
    "mod_header": "Islamic Beliefs",
    "mod_img": "https://www.newmuslims.com/upload/lessons/images/World_of_Jinn_(Part_1_of_2)._001.jpg",

    "lessons":  [
    {
        "id": "L1",
        "title": "What is Islam?",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "What is the religion that is practiced by 1.6 billion people around the world? What are their beliefs? Who do they worship? Find out in this first chapter.",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/what-is-islam.png",
        "text_1": "'Islam' is an Arabic term which means to submit one's will to the will of God. Islam is a monotheistic religion that teaches that there is only one divine being, one supreme Creator of the universe. Muslims believe that Islam is the true religion of God revealed to humanity. It is a universal religion that can be practiced by anyone at any time and in every place. The central concept of this way of life is total submission to God. Islam is a complete, holistic way of living that covers every aspect of life. Islam leaves no stone unturned as it teaches mankind on how to behave in every area of life: individual, social, material, moral, ethical, legal, cultural, political, economical, and global.",
        "text_2": "A Muslim is anyone who submits their will to the one and only true God who is worthy of worship, 'Allah' (God). A Muslim also believes in the Prophet Muhammad (peace be upon him) as the last and final prophet of God. By submitting oneself and worshiping Allah (God), a Muslim attains peace through obedience to his commandments. Peace is a natural result of submitting to the will of Allah. For a person to become a Muslim and accept Islam as their faith, they must say and believe in the following phrase: 'La ilaha illa Allah. Muhammad rasool Allah'. This sentence literally means “There is no God but Allah and Muhammad is His messenger.” The sentence also means “There is none worthy of worship except Allah, and Muhammad is His messenger.” The moment a person says this phrase and begins to act upon it they become a Muslim." ,
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {
        "id": "L2",
        "title": "The 5 Pillars to Islam",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "Islam is built upon 5 pillars, and practicing these pillars is important for all Muslims which include belief in one God, prayer, zakat, fasting, and pilgrimage.",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/5-pillars-of-islam.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {
        "id": "L3",
        "title": "The 6 Pillars of Faith",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "What makes up faith for a Muslim? Do they believe in the existence of Angels? What about scriptures such as the Torah and Gospel? Do they believe in other Prophets besides Muhammad?",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/6-pillars-of-iman-faith.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {
        "id": "L4",
        "title": "Story of Prophet Muhammad",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "Learn about the man who the Holy Qur'an was revealed to, and the man who Muslims believe is the last Prophet sent to mankind.",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/prophet-muhammad.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {  
        "id": "L5",
        "title": "The Afterlife",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "The moment of death, life in the grave, the Day of Judgement, Heaven and Hell. How do Muslims view the next life?",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/the-afterlife-in-islam.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {  
        "id": "L6",
        "title": "Paradise",
        "header_1": "Arabic Terms",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {  
        "id": "L7",
        "title": "Afterlife",
        "header_1": "Arabic Terms",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    }
    ]
},





{   
    "mod_id": "4",
    "mod_header": "Miracles of the Prophets",
    "mod_img": "https://www.mymasjid.ca/wp-content/uploads/2017/10/masjid-nabawi-prophet-mosque.jpg",

    "lessons":  [
    {
        "id": "L1",
        "title": "",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "What is the religion that is practiced by 1.6 billion people around the world? What are their beliefs? Who do they worship? Find out in this first chapter.",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/what-is-islam.png",
        "text_1": "'Islam' is an Arabic term which means to submit one's will to the will of God. Islam is a monotheistic religion that teaches that there is only one divine being, one supreme Creator of the universe. Muslims believe that Islam is the true religion of God revealed to humanity. It is a universal religion that can be practiced by anyone at any time and in every place. The central concept of this way of life is total submission to God. Islam is a complete, holistic way of living that covers every aspect of life. Islam leaves no stone unturned as it teaches mankind on how to behave in every area of life: individual, social, material, moral, ethical, legal, cultural, political, economical, and global.",
        "text_2": "A Muslim is anyone who submits their will to the one and only true God who is worthy of worship, 'Allah' (God). A Muslim also believes in the Prophet Muhammad (peace be upon him) as the last and final prophet of God. By submitting oneself and worshiping Allah (God), a Muslim attains peace through obedience to his commandments. Peace is a natural result of submitting to the will of Allah. For a person to become a Muslim and accept Islam as their faith, they must say and believe in the following phrase: 'La ilaha illa Allah. Muhammad rasool Allah'. This sentence literally means “There is no God but Allah and Muhammad is His messenger.” The sentence also means “There is none worthy of worship except Allah, and Muhammad is His messenger.” The moment a person says this phrase and begins to act upon it they become a Muslim." ,
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {
        "id": "L2",
        "title": "The 5 Pillars to Islam",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "Islam is built upon 5 pillars, and practicing these pillars is important for all Muslims which include belief in one God, prayer, zakat, fasting, and pilgrimage.",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/5-pillars-of-islam.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {
        "id": "L3",
        "title": "The 6 Pillars of Faith",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "What makes up faith for a Muslim? Do they believe in the existence of Angels? What about scriptures such as the Torah and Gospel? Do they believe in other Prophets besides Muhammad?",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/6-pillars-of-iman-faith.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {
        "id": "L4",
        "title": "Story of Prophet Muhammad",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "Learn about the man who the Holy Qur’an was revealed to, and the man who Muslims believe is the last Prophet sent to mankind.",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/prophet-muhammad.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {  
        "id": "L5",
        "title": "The Afterlife",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "The moment of death, life in the grave, the Day of Judgement, Heaven and Hell. How do Muslims view the next life?",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/the-afterlife-in-islam.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {  
        "id": "L6",
        "title": "Paradise",
        "header_1": "Arabic Terms",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {  
        "id": "L7",
        "title": "Afterlife",
        "header_1": "Arabic Terms",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    }
    ]
},



{   
    "mod_id": "5",
    "mod_header": "Mosques and World of Jinn",
    "mod_img": "https://www.newmuslims.com/upload/lessons/images/Friday_Prayer_part_2._001.jpg",

    "lessons":  [
    {
        "id":"L1",
        "title": "What is Islam?",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "What is the religion that is practiced by 1.6 billion people around the world? What are their beliefs? Who do they worship? Find out in this first chapter.",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/what-is-islam.png",
        "text_1": "'Islam' is an Arabic term which means to submit one's will to the will of God. Islam is a monotheistic religion that teaches that there is only one divine being, one supreme Creator of the universe. Muslims believe that Islam is the true religion of God revealed to humanity. It is a universal religion that can be practiced by anyone at any time and in every place. The central concept of this way of life is total submission to God. Islam is a complete, holistic way of living that covers every aspect of life. Islam leaves no stone unturned as it teaches mankind on how to behave in every area of life: individual, social, material, moral, ethical, legal, cultural, political, economical, and global.",
        "text_2": "A Muslim is anyone who submits their will to the one and only true God who is worthy of worship, 'Allah' (God). A Muslim also believes in the Prophet Muhammad (peace be upon him) as the last and final prophet of God. By submitting oneself and worshiping Allah (God), a Muslim attains peace through obedience to his commandments. Peace is a natural result of submitting to the will of Allah. For a person to become a Muslim and accept Islam as their faith, they must say and believe in the following phrase: 'La ilaha illa Allah. Muhammad rasool Allah'. This sentence literally means “There is no God but Allah and Muhammad is His messenger.” The sentence also means “There is none worthy of worship except Allah, and Muhammad is His messenger.” The moment a person says this phrase and begins to act upon it they become a Muslim." ,
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {
        "id": "L2",
        "title": "The 5 Pillars to Islam",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "Islam is built upon 5 pillars, and practicing these pillars is important for all Muslims which include belief in one God, prayer, zakat, fasting, and pilgrimage.",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/5-pillars-of-islam.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {
        "id": "L3",
        "title": "The 6 Pillars of Faith",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "What makes up faith for a Muslim? Do they believe in the existence of Angels? What about scriptures such as the Torah and Gospel? Do they believe in other Prophets besides Muhammad?",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/6-pillars-of-iman-faith.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {
        "id": "L4",
        "title": "Story of Prophet Muhammad",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "Learn about the man who the Holy Qur’an was revealed to, and the man who Muslims believe is the last Prophet sent to mankind.",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/prophet-muhammad.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {  
        "id": "L5",
        "title": "The Afterlife",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "The moment of death, life in the grave, the Day of Judgement, Heaven and Hell. How do Muslims view the next life?",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/the-afterlife-in-islam.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {  
        "id": "L6",
        "title": "Paradise",
        "header_1": "Arabic Terms",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {  
        "id": "L7",
        "title": "Afterlife",
        "header_1": "Arabic Terms",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    }
    ]
},



{   
    "mod_id": "6",
    "mod_header": "Sacred Cities and Pilgrimage",
    "mod_img": "https://www.mymasjid.ca/wp-content/uploads/2016/10/why-do-we-pray.png",

    "lessons":  [
    {
        "id": "L1",
        "title": "What is Islam?",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "What is the religion that is practiced by 1.6 billion people around the world? What are their beliefs? Who do they worship? Find out in this first chapter.",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/what-is-islam.png",
        "text_1": "'Islam' is an Arabic term which means to submit one's will to the will of God. Islam is a monotheistic religion that teaches that there is only one divine being, one supreme Creator of the universe. Muslims believe that Islam is the true religion of God revealed to humanity. It is a universal religion that can be practiced by anyone at any time and in every place. The central concept of this way of life is total submission to God. Islam is a complete, holistic way of living that covers every aspect of life. Islam leaves no stone unturned as it teaches mankind on how to behave in every area of life: individual, social, material, moral, ethical, legal, cultural, political, economical, and global.",
        "text_2": "A Muslim is anyone who submits their will to the one and only true God who is worthy of worship, 'Allah' (God). A Muslim also believes in the Prophet Muhammad (peace be upon him) as the last and final prophet of God. By submitting oneself and worshiping Allah (God), a Muslim attains peace through obedience to his commandments. Peace is a natural result of submitting to the will of Allah. For a person to become a Muslim and accept Islam as their faith, they must say and believe in the following phrase: 'La ilaha illa Allah. Muhammad rasool Allah'. This sentence literally means “There is no God but Allah and Muhammad is His messenger.” The sentence also means “There is none worthy of worship except Allah, and Muhammad is His messenger.” The moment a person says this phrase and begins to act upon it they become a Muslim." ,
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {
        "id": "L2",
        "title": "The 5 Pillars to Islam",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "Islam is built upon 5 pillars, and practicing these pillars is important for all Muslims which include belief in one God, prayer, zakat, fasting, and pilgrimage.",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/5-pillars-of-islam.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {
        "id": "L3",
        "title": "The 6 Pillars of Faith",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "What makes up faith for a Muslim? Do they believe in the existence of Angels? What about scriptures such as the Torah and Gospel? Do they believe in other Prophets besides Muhammad?",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/6-pillars-of-iman-faith.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {
        "id": "L4",
        "title": "Story of Prophet Muhammad",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "Learn about the man who the Holy Qur’an was revealed to, and the man who Muslims believe is the last Prophet sent to mankind.",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/prophet-muhammad.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {  
        "id": "L5",
        "title": "The Afterlife",
        "header_1": "",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "description": "The moment of death, life in the grave, the Day of Judgement, Heaven and Hell. How do Muslims view the next life?",
        "image": "https://www.mymasjid.ca/wp-content/uploads/2016/11/the-afterlife-in-islam.png",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {  
        "id": "L6",
        "title": "Paradise",
        "header_1": "Arabic Terms",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    },

    {  
        "id": "L7",
        "title": "Afterlife",
        "header_1": "Arabic Terms",
        "header_2": "",
        "header_3": "",
        "header_4": "",
        "header_5": "",
        "text_1": "",
        "text_2": "",
        "text_3": "",
        "text_4": "",
        "text_5": ""
    }
    ]
}

]
}